{
  "title": "Meu Portfólio",
  "close": "fechar",
  "time-line": "Linha do Tempo",
  "my-trajectory": "Minha trajetória",
  "knowledge": "Conhecimento",
  "my_interests": "Meus interesses",
  "about": "Sobre",
  "about_me": "Sobre mim",
  "activities": "Atividades Desenvolvidas:",
  "technologies": "Tecnologias:",
  "emphasis": "Feitos de destaque:",
  "about_me_sentence_1": "Me chamo Thiago Bomfim, e sou um engenheiro de software.\n",
  "about_me_sentence_2": "Eu sou muito apaixonado pelo potencial que a tecnologia tem de mudar a vida das pessoas.\n",
  "about_me_sentence_3": "Isso me motiva a estar estudando cada vez mais, pois compartilho do pensamento ",
  "about_me_sentence_4": "\"Para quem só sabe usar martelo, todo problema é prego\"",
  "about_me_sentence_5": ", então estou sempre estudando e aprendendo as melhores praticas e melhores maneiras de resolver determinado problema.",
  "about_me_it_sentence_1": "Sou adepto ao manifesto agil e as boas práticas.\n",
  "about_me_it_sentence_2": "Penso que o código precisa ser simples e que consiga agregar valor para determinada pessoa. Tento sempre fazer código limpo, seguindo os princípios do SOLID e também compartilho do pensamento ",
  "about_me_it_sentence_3": "\"Código legado é aquele sem testes.\"",
  "ucb_course": "Graduação em Sistema de Informação",
  "mirante_job_1_position": "Estágiario",
  "mirante_job_1_emphasis": "Integração com VOIP(Callbox) via API REST.\nInclusão do Flyway para o gerenciamento de scripts.",
  "mirante_job_1_technologies": "Java 8, Spring, Wicket, HTML, CSS, JS, JasperReport, Git e SQL Server.",
  "mirante_job_1_tasks": "Criação e manutenção de um sistema para gerenciamento de hotéis, contratos, e área de atendimento para o contratante do serviço prestado pela Montreal Turismo.",
  "singular_job_1_position": "Engenheiro de Software",
  "singular_job_1_technologies": "Java 8, Hibernate, Wicket, Spring e Git.",
  "singular_job_1_tasks": "Desenvolvimento de componentes e manutenção na arquitetura para uma plataforma\nopen source.",
  "mirante_job_2_position": "Engenheiro de Software",
  "mirante_job_2_emphasis": "Realização de integração com API REST para realização de pagamentos com PagTesouro.\nEvolução e manutenção de um dos principais sistemas da Anvisa.",
  "mirante_job_2_technologies": "Flutter, Java 8, Java 11, Angular, Angular JS, JSF, Hibernate, Wicket, Spring, Jenkins, Gitlab CI/CD, OracleSQL e SQLServer. ",
  "mirante_job_2_tasks": "Análise e desenvolvimento de sistemas para a Anvisa, que proporcionou uma economia de mais de 32 milhões em um ano.\nAnálise e desenvolvimento de um aplicativo Mobile para o Incra e de uma API REST para comunicação.",
  "dio_job_1_position": "Instrutor de Flutter",
  "dio_job_1_technologies": "Flutter, Gitlab CI. ",
  "dio_job_1_tasks": "Criação de 3 módulos ensinando Flutter.\nUm módulo introdutório.\nUm módulo contendo integração com API Rest.\nUm módulo ensinando a realizar uma aplicação do zero à produção.",
  "igti_course": "MBA em Desenvolvimento Mobile",
  "singular_job_2_position": "Engenheiro de Software",
  "singular_job_2_emphasis": "Integração de uma ferramente para assinatura digital.\nIntegração de login com o GOV.BR via OAUTH2.\nInclusão do Flyway para o gerenciamento de scripts.",
  "singular_job_2_technologies": "Java 8, Hibernate, Wicket, Spring, Git, HTML, CSS, JS, Dart, Flutter, Docker, PostgreSQL.",
  "singular_job_2_tasks": "Criação, implementação, manutenção e implantação de uma plataforma no code.",
  "aubay_job_1_position": "Engenheiro de Software / DevOps",
  "aubay_job_1_emphasis": "Melhoria na pipeline e apoio na automatização CI/CD. \nEvoluções no código da aplicação diminuindo em 30% o tempo de build da aplicação.\nInclusão do Sonar e apoio na criação de evolução dos testes unitários.",
  "aubay_job_1_technologies": "Java 8/11/17, Spring Boot, SQL, SOAP, Jenkins, Git, Docker, Kubernetes, Helm, OpenShift, ElasticSearch, Splunk",
  "aubay_job_1_tasks": "• Responsável pela gestão e definição do pipeline de CI/CD;\n• Responsável pelo Ambiente Cloud;\n• Treinar equipes com melhores práticas e qualidade de código;\n• Crie componentes e código de design para melhorar o trabalho em equipe;\n• Criação de microserviços para integração com sistemas internos\n• Mentoria e entrevistas técnicas."
}
